Revit 2025 API
ExporterIFCUtils.GetNumBuildingStoreys Method
 Returns the number of non-empty, non-duplicate building stories in the file.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static int GetNumBuildingStoreys(
	ExporterIFC exporterIFC
)
Public Shared Function GetNumBuildingStoreys (
	exporterIFC As ExporterIFC
) As Integer
public:
static int GetNumBuildingStoreys(
	ExporterIFC^ exporterIFC
)
static member GetNumBuildingStoreys :
        exporterIFC : ExporterIFC -> int
Parameters
exporterIFC ExporterIFC
 The exporter.
Return Value
Int32
 The number of stories.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace